# pandas

In [3]:
# pandas import
import pandas as pd

### Sereise
- 1개의 컬럼 값으로 구성된 1차원 데이터 셋

In [8]:
data = ["A", "B", "C", "D"]
se = pd.Series(data) # 가장 기본적인 형태
se # 엑셀의 한 열로 보여야 함

0    A
1    B
2    C
3    D
dtype: object

In [9]:
se.index # 데이터의 개수 확인용

# start : n부터 시작
# stop : n개
# step : n씩 커진다

RangeIndex(start=0, stop=4, step=1)

In [10]:
se.values # 담겨있는 값을 알려줌

array(['A', 'B', 'C', 'D'], dtype=object)

In [13]:
# 인덱싱
print(se[1])
print(se[3])

B
D

In [16]:
# 슬라이싱
print(se[:2])
print(se[:])

0    A
1    B
dtype: object
0    A
1    B
2    C
3    D
dtype: object

In [18]:
# 컬럼 이름 변경
se.name = "alphabet"
se

0    A
1    B
2    C
3    D
Name: alphabet, dtype: object

In [20]:
# 인덱스 이름 설정
se.index.name = "No."
se

No.
0    A
1    B
2    C
3    D
Name: alphabet, dtype: object

In [22]:
# Series 생성 시 index 지정하기
data = ["A", "B", "C", "D"]

se = pd.Series(data, index=['a', 'b', 'c','d'])
print(se)
print(se['a']) # 인덱스 값으로 가져오기

a    A
b    B
c    C
d    D
dtype: object
A

In [24]:
# Series 생성 후 index 지정하기
se.index=[1,2,3,4]
print(se)

1    A
2    B
3    C
4    D
dtype: object

### DataFrame

In [4]:
import numpy as np

data = np.array([[1,2,3], [4,5,6], [7,8,9]]) # serise가 모여 있는 형태
column = ['D', 'E', 'F']

df = pd.DataFrame(data=data, index=['A', 'B', 'C'], columns=column)
df

# df = pd.read_csv

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [72]:
# DataFrame 생성
data = {
    'country' : ["kor", "usa", "china", "japan"],
    'rank' : [1,2,3,4],
    'grade' : ["A", "B", "C", "D"]
}
df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [73]:
# (1) DataFrame 생성 시 인덱스 지정
df = pd.DataFrame(data, index=["a", "b", "c", "d"])
df

  country  rank grade
a     kor     1     A
b     usa     2     B
c   china     3     C
d   japan     4     D

In [74]:
# (2) df.index로 인덱스 지정
df.index = ["a", "b", "c", "d"]
df

  country  rank grade
a     kor     1     A
b     usa     2     B
c   china     3     C
d   japan     4     D

In [75]:
# (3) df.set_index로 인덱스 지정
df = df.set_index('grade')
df

      country  rank
grade
A         kor     1
B         usa     2
C       china     3
D       japan     4

### 데이터 셀랙션
- DataFrame에서 값을 불러오는 방법

1) [ ] 

2) loc[인덱스명, 컬럼명] #명칭(label) 기반 인덱싱

3) iloc[인덱스명, 컬럼인덱스] #위치(position) 기반 인덱싱

In [76]:
data = {
    'country' : ["kor", "usa", "china", "japan"],
    'rank' : [1,2,3,4],
    'grade' : ["A", "B", "C", "D"]
}
df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [77]:
# 1) df.컬럼, df['컬럼']

## 하나의 컬럼 조회
df.country # = df['country']

0      kor
1      usa
2    china
3    japan
Name: country, dtype: object

In [78]:
# 둘 이상의 컬럼 조회
df[['country', 'grade']]

  country grade
0     kor     A
1     usa     B
2   china     C
3   japan     D

In [79]:
# 2) loc[인덱스명, 컬럼명]

## 인덱스 값이 0인 행 조회
df.loc[0]

country    kor
rank         1
grade        A
Name: 0, dtype: object

In [80]:
## 2개 이상의 행 조회
df.loc[0:2, ['grade', 'rank']]

  grade  rank
0     A     1
1     B     2
2     C     3

In [81]:
df.loc[[1,3]] # 인덱스 값 1, 3 행 가져오기

# 여러개 가져올 땐 인덱싱, 범위를 가져올 때는 슬라이싱

  country  rank grade
1     usa     2     B
3   japan     4     D

In [82]:
df.loc[0, 'grade'] # 행과 열의 좌표

'A'

In [83]:
df.loc[0:2, ['country', 'grade']] # 인덱스 0부터 2까지의 country열과 grade열 가져오기

  country grade
0     kor     A
1     usa     B
2   china     C

In [84]:
df.loc[ (df['grade']=="A") | (df['rank']>2) ]

  country  rank grade
0     kor     1     A
2   china     3     C
3   japan     4     D

#### df.iloc

In [85]:
df.loc[0:2] # 인덱스의 범위 => 인덱스 0~2까지
df.iloc[0:2] # 행의 범위 => 행 0~1까지

  country  rank grade
0     kor     1     A
1     usa     2     B

In [86]:
# 한국과 일본의 rank, grade만 가져오기
df.iloc[[0,3], [1,2]] 
df.loc[[0,3], ['rank', 'grade']]

   rank grade
0     1     A
3     4     D

### filter()를 이용한 검색

In [87]:
df.filter?

SyntaxError: invalid syntax (1774805028.py, line 1)

In [88]:
df.filter(like='c', axis=1) 
# like='c' => 인덱스에 c가 포함된 것들 다 가져와라
# axis=1 => col | axis=0 => row

  country
0     kor
1     usa
2   china
3   japan

In [89]:
# 1) Series를 이용하여 열 데이터 추가
president = pd.Series(["yoon", "biden", "kishida", "jinping"], index=[0,1,2,3])
president

df['president']=president
df

  country  rank grade president
0     kor     1     A      yoon
1     usa     2     B     biden
2   china     3     C   kishida
3   japan     4     D   jinping

In [90]:
# 2) Numpy를 이용하여 열 데이터 추가
import numpy as np

add = np.zeros(4).astype(int)
df['etc'] = add
df

  country  rank grade president  etc
0     kor     1     A      yoon    0
1     usa     2     B     biden    0
2   china     3     C   kishida    0
3   japan     4     D   jinping    0

In [91]:
# 3) 연산을 이용하여 열 데이터 추가
import numpy as np

df['new_grade'] = df['rank']<3
df

  country  rank grade president  etc  new_grade
0     kor     1     A      yoon    0       True
1     usa     2     B     biden    0       True
2   china     3     C   kishida    0      False
3   japan     4     D   jinping    0      False

In [92]:
# 4) loc()을 이용하여 행 데이터 추가
import numpy as np

df.loc[7] = ['singapole', 4, "D", "jao", 0, False]
df

     country  rank grade president  etc  new_grade
0        kor     1     A      yoon    0       True
1        usa     2     B     biden    0       True
2      china     3     C   kishida    0      False
3      japan     4     D   jinping    0      False
7  singapole     4     D       jao    0      False

In [107]:
df.reset_index()
df

     country  rank grade president  etc  new_grade
0        kor     1     A      yoon    0       True
1        usa     2     B     biden    0       True
7  singapole     4     D       jao    0      False

## DataFrame 데이터 삭제

In [108]:
# 1) drop
## 행 삭제
df = df.drop(index=2) # 실제로 삭제가 되지 않음
df.drop

KeyError: '[2] not found in axis'